[
  {
    "title": "Moroccan Couscous",
    "ingredients": "1 c Orange or other juice|1 c Instant couscous|1/4 c Pitted dates, finely chopped|1/4 c Raisins|1/4 c Slivered almonds|1 ts Cinnamon",
    "servings": "4 Servings",
    "instructions": "Bring juice and 1/2 cup water to a boil in a small pot. Remove from heat. Stir in couscous and allow to sit covered for 5 minutes. Meanwhile, in a separate pan, saute dates, raisins, almonds and cinnamon in 1/2 cup water for 2 minutes. Add cooked couscous. Mix well and serve warm. Makes 4 servings. Per serving: 301 calories, 8 grams protein, 59 grams carbohydrates, 4 grams fat, 0 grams saturated fat, 0 milligrams cholesterol, 7 milligrams sodium."
  },
  {
    "title": "Moroccan Salad",
    "ingredients": "2/3 c Bulgar wheat|1 1/3 c Boiling water|4 Scallions; chopped|1 2/3 c Fresh parsley; minced|1/3 c Fresh mint; minced|1 1/4 lg Tomatoes; diced|2/3 c Cucumber; peeled, seeded, diced|2 tb Olive oil; plus 2 teaspoons|2 tb Fresh lemon juice; plus 2 teaspoons|1 1/4 ts Cumin|2 Cloves garlic; minced|1 1/4 Whole wheat pita bread loaves",
    "servings": "4 Servings",
    "instructions": "Combine the bulgur wheat with the boiling water in a heat-proof bowl. Let stand 1 hour until the wheat has absorbed the water. Combine the remaining ingredients except the pita bread in a large salad bowl. Cut the pita bread into triangles. Place the triangles on a cookie sheet and bake at 350øF until crisp, about 15 minutes. Remove from the oven and add to the salad bowl. Drain any excess water from the wheat. Add to the salad bowl and mix well. Refrigerate for 1-2 hours before serving. Per serving: calories 263, fat 10.4g, 33% calories from fat, cholesterol 0mg, protein 7.5g, carbohydrates 39.7g, fiber 10.8g, sodium 129mg. Exchanges: 1/2 Monosaturated Fat, 2 Starch, 1 Vegetable. The recommended wines are: Chenin Blanc, Chianti, or Fum Blanc. NOTES : Prep: 15 min, Marinate: 1:00, Cook: 15 min, plus refrigeration time."
  },
  {
    "title": "Individual B'stillas (Moroccan Chicken And Almond Pies) Pt 2",
    "ingredients": "See part 1",
    "servings": "1 servings",
    "instructions": "half sheet of phyllo with short side facing you and brush with melted butter. On this, layer and brush 3 more half sheets of phyllo in the same manner. Sprinkle 1 tablespoon almond sugar on short side of phyllo nearest you to cover about 2 1/2-by 4-inch area, leaving a 1-inch border on 3 edges. Put 1/3 cup chicken mixture over almond sugar and spread out slightly. Top chicken mixture with 1 more tablespoon almond sugar and roll up filling in phyllo, folding in sides after first roll. Transfer b'stilla immediately. Form 8 more b'stillas in the same manner with remaining phyllo, butter, almond sugar, and chicken mixture, chilling each b'stilla as it is made. B'stillas may be prepared up to this point 4 hours ahead and kept chilled, covered lightly with plastic wrap once cold. Bake chilled b'stillas in oven until tops and ends are puffed and browned, 15 to 20 minutes. Cool b'stillas slightly on a rack. Sprinkle b'stillas with confectioners' sugar and cinnamon and serve warm. To make the ras el hanout: In a spice grinder or cleaned coffee grinder grind fine aniseed, fennel seeds, allspice berries, cardamom seeds, cloves, peppercorns, cinnamon stick, sesame seeds, coriander seeds, cuminseed, and red pepper flakes, In a small bowl stir together ground spice mixture, mace, ginger, and nutmeg until combine well. Ras el hanout may be stored in a tightly closed jar in a cool dark place up to 6 months. Makes about 1/4 cup. Makes 9 b'stillas, to serve 6 with second helpings."
  },
  {
    "title": "Meshoui (Moroccan Lamb)",
    "ingredients": "4 lb Leg of lamb|1 Carrot|1 md Onion|2 Tomatoes|1 Rib celery|1 bn Fresh parsley|1 tb Paprika|1 tb Salt|1 tb Black pepper|2 tb Chopped garlic|1 qt Water",
    "servings": "5 Servings",
    "instructions": "Preheat oven to 350F. All Vegetables should be coarsely chopped. Rub paprika, salt, pepper, and garlic all over lamb. Set aside. In a roasting pan, nestle lamb in the center of the vegetables and cook, uncovered for approximately 20 min (for 4-pound leg) or until top of lamb is brown. Add water, cover, and cook for 1 1/2 hours for medium done roast. Makes 5 servings. LAMB SAUCE: Strain Vegetables from roasting pan. Put drippings in a heavy pan. Add: 2 tb tomato paste and 1 quart of water. Simmer for about 15 minutes, skimming grease from top of sauce several times."
  },
  {
    "title": "Moroccan Fish",
    "ingredients": "5 Garlic cloves, chopped|2 tb Cumin|2 tb Olive oil|1 tb Pepper flakes, dried|2 tb Cilantro, chopped|Juice of 1/2 lemon|1 lb Red snapper filets",
    "servings": "4 Servings",
    "instructions": "Preheat oven to 350 degrees F. Mix garlic, cumin, olive oil, pepper flakes, cilantro and lemon juice into a paste. Put the filets in a shallow baking dish and spread this paste over them. Cover tightly with foil. Bake at 350 degrees F. for 5 to 10 minutes (a little longer if the filets are thick). NOTES: * You could substitute other types of fish. : Difficulty: easy. : Time: 10 minutes preparation, 10 minutes cooking. : Precision: Approximate measurement OK."
  }
]